ServiceDesk/src/Documents/ЕжедневныйОтчет/ЕжедневныйОтчет.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>ЕжедневныйОтчет</name>
  <registerRecords>AccumulationRegister.РабочееВремяПользователей</registerRecords>
  <attributes>
    <name>Исполнитель</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>ОтчетнаяДата</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ЗатратыВремени</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Time</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <tabularSections>
    <name>ИспользованиеВремени</name>
    <attributes>
      <name>Длительность</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Time</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ДлительностьЧисло</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Заявка</name>
      <type>
        <types>DocumentRef.ЗаявкаПользователя</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

ServiceDesk/src/Documents/ЕжедневныйОтчет/Forms/ФормаДокумента/Module.bsl
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если Параметры.Ключ.Пустая() Тогда			
		Объект.Дата			= ТекущаяДата();		
		Объект.ОтчетнаяДата	= ТекущаяДата();
		Объект.Исполнитель	= ПараметрыСеанса.ТекущийПользователь;		
	КонецЕсли;                                                            	
	
КонецПроцедуры

&НаКлиенте
Процедура ИспользованиеВремениЗаявкаНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)	
	СтандартнаяОбработка	= Ложь;	
	ОткрытьФорму("Документ.ЗаявкаПользователя.Форма.ФормаВыбораДляУРВ",,Элемент);	
КонецПроцедуры

&НаКлиенте
Процедура ИспользованиеВремениДлительностьПриИзменении(Элемент)	
	ПересчетДлительности();		
КонецПроцедуры

&НаКлиенте
Процедура ИспользованиеВремениПриОкончанииРедактирования(Элемент, НоваяСтрока, ОтменаРедактирования)	
	Если НоваяСтрока Тогда
		ПересчетДлительности();
	КонецЕсли;	
КонецПроцедуры

&НаКлиенте
Процедура ПересчетДлительности()
	
	//Затраты времени всего, начало дня, окончание дня
	ЗатратыВремениВСекундах = 0;
	
	
	Для Каждого СтрокаТЧ Из Объект.ИспользованиеВремени Цикл  
		
     	ЗатратыВремениВСекундах		= ЗатратыВремениВСекундах + (СтрокаТЧ.Длительность - НачалоДня(СтрокаТЧ.Длительность));      			
		
	КонецЦикла;
	
	//Всего
	ЗатратыВремениВСекундах = ?(ЗатратыВремениВСекундах > 23 * 3600, 23 * 3600, ЗатратыВремениВСекундах);
	
	КолВоЧасов = Цел(ЗатратыВремениВСекундах/(3600));
	КолВоМинут = Цел((ЗатратыВремениВСекундах - КолВоЧасов*3600)/60);

	Объект.ЗатратыВремени = Дата(0001,01,01,КолВоЧасов,КолВоМинут,00);
	
КонецПроцедуры

&НаСервере
Процедура ПередЗаписьюНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
	
	ДатаЗапретаРедактированияУРВ	= Константы.ДатаЗапретаРедактированияУРВ.Получить();
	
	Если ТекущийОбъект.ОтчетнаяДата <= ДатаЗапретаРедактированияУРВ Тогда
		Сообщение	= Новый СообщениеПользователю;
		Сообщение.Текст			= "Период до " + Формат(ДатаЗапретаРедактированияУРВ, "ДЛФ=Д") + " редактировать нельзя";
		Сообщение.Поле			= "ОтчетнаяДата";
		Сообщение.ПутьКДанным	= "Объект";
		Сообщение.КлючДанных	= Объект.Ссылка;               			
		Сообщение.Сообщить();	
		Отказ	= Истина;    		
	КонецЕсли;
	
КонецПроцедуры
